---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElemDeletableInFamily
source: html/2e0d9ec4-905d-d863-f422-70234e750fbd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElemDeletableInFamily Property

"Deletable"

## Syntax (C#)
```csharp
public static ForgeTypeId ElemDeletableInFamily { get; }
```